{"backend": "tensorflow", "keras_version": "2.2.5", "class_name": "Model", "config": {"name": "model_1", "output_layers": [["dense_5", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1_pad", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv1_pad", "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "dtype": "float32"}}, {"inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "name": "conv1", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "valid", "name": "conv1", "use_bias": false, "bias_regularizer": null, "strides": [2, 2], "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "dilation_rate": [1, 1], "dtype": "float32", "filters": 32}}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "conv1_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "name": "conv1_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv1_relu"}}, {"inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "name": "conv_dw_1", "class_name": "DepthwiseConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "name": "conv_dw_1", "dtype": "float32", "depthwise_constraint": null}}, {"inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "name": "conv_dw_1_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_dw_1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "name": "conv_dw_1_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_dw_1_relu"}}, {"inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "name": "conv_pw_1", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv_pw_1", "use_bias": false, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "dtype": "float32", "filters": 64}}, {"inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "name": "conv_pw_1_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_pw_1_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "name": "conv_pw_1_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_pw_1_relu"}}, {"inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "name": "conv_pad_2", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv_pad_2", "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "dtype": "float32"}}, {"inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "name": "conv_dw_2", "class_name": "DepthwiseConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "strides": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "name": "conv_dw_2", "dtype": "float32", "depthwise_constraint": null}}, {"inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "name": "conv_dw_2_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_dw_2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "name": "conv_dw_2_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_dw_2_relu"}}, {"inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "name": "conv_pw_2", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv_pw_2", "use_bias": false, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "dtype": "float32", "filters": 128}}, {"inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "name": "conv_pw_2_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_pw_2_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "name": "conv_pw_2_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_pw_2_relu"}}, {"inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "name": "conv_dw_3", "class_name": "DepthwiseConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "name": "conv_dw_3", "dtype": "float32", "depthwise_constraint": null}}, {"inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "name": "conv_dw_3_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_dw_3_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "name": "conv_dw_3_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_dw_3_relu"}}, {"inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "name": "conv_pw_3", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv_pw_3", "use_bias": false, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "dtype": "float32", "filters": 128}}, {"inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "name": "conv_pw_3_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_pw_3_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "name": "conv_pw_3_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_pw_3_relu"}}, {"inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "name": "conv_pad_4", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv_pad_4", "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "dtype": "float32"}}, {"inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "name": "conv_dw_4", "class_name": "DepthwiseConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "strides": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "name": "conv_dw_4", "dtype": "float32", "depthwise_constraint": null}}, {"inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "name": "conv_dw_4_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_dw_4_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "name": "conv_dw_4_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_dw_4_relu"}}, {"inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "name": "conv_pw_4", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv_pw_4", "use_bias": false, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "dtype": "float32", "filters": 256}}, {"inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "name": "conv_pw_4_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_pw_4_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "name": "conv_pw_4_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_pw_4_relu"}}, {"inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "name": "conv_dw_5", "class_name": "DepthwiseConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "name": "conv_dw_5", "dtype": "float32", "depthwise_constraint": null}}, {"inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "name": "conv_dw_5_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_dw_5_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "name": "conv_dw_5_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_dw_5_relu"}}, {"inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "name": "conv_pw_5", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv_pw_5", "use_bias": false, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "dtype": "float32", "filters": 256}}, {"inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "name": "conv_pw_5_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_pw_5_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "name": "conv_pw_5_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_pw_5_relu"}}, {"inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "name": "conv_pad_6", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv_pad_6", "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "dtype": "float32"}}, {"inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "name": "conv_dw_6", "class_name": "DepthwiseConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "strides": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "name": "conv_dw_6", "dtype": "float32", "depthwise_constraint": null}}, {"inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "name": "conv_dw_6_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_dw_6_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "name": "conv_dw_6_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_dw_6_relu"}}, {"inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "name": "conv_pw_6", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv_pw_6", "use_bias": false, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "dtype": "float32", "filters": 512}}, {"inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "name": "conv_pw_6_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_pw_6_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "name": "conv_pw_6_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_pw_6_relu"}}, {"inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "name": "conv_dw_7", "class_name": "DepthwiseConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "name": "conv_dw_7", "dtype": "float32", "depthwise_constraint": null}}, {"inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "name": "conv_dw_7_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_dw_7_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "name": "conv_dw_7_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_dw_7_relu"}}, {"inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "name": "conv_pw_7", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv_pw_7", "use_bias": false, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "dtype": "float32", "filters": 512}}, {"inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "name": "conv_pw_7_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_pw_7_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "name": "conv_pw_7_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_pw_7_relu"}}, {"inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "name": "conv_dw_8", "class_name": "DepthwiseConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "name": "conv_dw_8", "dtype": "float32", "depthwise_constraint": null}}, {"inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "name": "conv_dw_8_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_dw_8_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "name": "conv_dw_8_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_dw_8_relu"}}, {"inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "name": "conv_pw_8", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv_pw_8", "use_bias": false, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "dtype": "float32", "filters": 512}}, {"inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "name": "conv_pw_8_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_pw_8_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "name": "conv_pw_8_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_pw_8_relu"}}, {"inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "name": "conv_dw_9", "class_name": "DepthwiseConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "name": "conv_dw_9", "dtype": "float32", "depthwise_constraint": null}}, {"inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "name": "conv_dw_9_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_dw_9_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "name": "conv_dw_9_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_dw_9_relu"}}, {"inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "name": "conv_pw_9", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv_pw_9", "use_bias": false, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "dtype": "float32", "filters": 512}}, {"inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "name": "conv_pw_9_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_pw_9_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "name": "conv_pw_9_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_pw_9_relu"}}, {"inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "name": "conv_dw_10", "class_name": "DepthwiseConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "name": "conv_dw_10", "dtype": "float32", "depthwise_constraint": null}}, {"inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "name": "conv_dw_10_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_dw_10_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "name": "conv_dw_10_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_dw_10_relu"}}, {"inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "name": "conv_pw_10", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv_pw_10", "use_bias": false, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "dtype": "float32", "filters": 512}}, {"inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "name": "conv_pw_10_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_pw_10_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "name": "conv_pw_10_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_pw_10_relu"}}, {"inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "name": "conv_dw_11", "class_name": "DepthwiseConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "name": "conv_dw_11", "dtype": "float32", "depthwise_constraint": null}}, {"inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "name": "conv_dw_11_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_dw_11_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "name": "conv_dw_11_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_dw_11_relu"}}, {"inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "name": "conv_pw_11", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv_pw_11", "use_bias": false, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "dtype": "float32", "filters": 512}}, {"inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "name": "conv_pw_11_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_pw_11_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "name": "conv_pw_11_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_pw_11_relu"}}, {"inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "name": "conv_pad_12", "class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "conv_pad_12", "padding": [[0, 1], [0, 1]], "data_format": "channels_last", "dtype": "float32"}}, {"inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "name": "conv_dw_12", "class_name": "DepthwiseConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "strides": [2, 2], "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "name": "conv_dw_12", "dtype": "float32", "depthwise_constraint": null}}, {"inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "name": "conv_dw_12_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_dw_12_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "name": "conv_dw_12_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_dw_12_relu"}}, {"inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "name": "conv_pw_12", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv_pw_12", "use_bias": false, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "dtype": "float32", "filters": 1024}}, {"inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "name": "conv_pw_12_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_pw_12_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "name": "conv_pw_12_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_pw_12_relu"}}, {"inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "name": "conv_dw_13", "class_name": "DepthwiseConv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "depthwise_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "depth_multiplier": 1, "strides": [1, 1], "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "trainable": true, "name": "conv_dw_13", "dtype": "float32", "depthwise_constraint": null}}, {"inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "name": "conv_dw_13_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_dw_13_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "name": "conv_dw_13_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_dw_13_relu"}}, {"inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "name": "conv_pw_13", "class_name": "Conv2D", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv_pw_13", "use_bias": false, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_size": [1, 1], "trainable": true, "dilation_rate": [1, 1], "dtype": "float32", "filters": 1024}}, {"inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "name": "conv_pw_13_bn", "class_name": "BatchNormalization", "config": {"momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "name": "conv_pw_13_bn", "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_constraint": null, "dtype": "float32"}}, {"inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "name": "conv_pw_13_relu", "class_name": "ReLU", "config": {"negative_slope": 0.0, "threshold": 0.0, "trainable": true, "dtype": "float32", "max_value": 6.0, "name": "conv_pw_13_relu"}}, {"inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "name": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "dtype": "float32", "data_format": "channels_last", "name": "global_average_pooling2d_1"}}, {"inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_1", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "units": 1024, "dtype": "float32"}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_2", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "units": 1024, "dtype": "float32"}}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dense_3", "class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_3", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "units": 512, "dtype": "float32"}}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dense_4", "class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_4", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "units": 60, "dtype": "float32"}}, {"inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "dense_5", "class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "name": "dense_5", "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "units": 4, "dtype": "float32"}}], "input_layers": [["input_1", 0, 0]]}}