{"backend": "tensorflow", "keras_version": "2.2.5", "class_name": "Model", "config": {"name": "model_1", "output_layers": [["dense_5", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "name": "input_1", "sparse": false}}, {"name": "conv1_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"name": "conv1_pad", "trainable": true, "padding": [[0, 1], [0, 1]], "dtype": "float32", "data_format": "channels_last"}}, {"name": "conv1", "class_name": "Conv2D", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "filters": 32, "padding": "valid", "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv1", "activity_regularizer": null, "activation": "linear", "strides": [2, 2], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "conv1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv1_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv1_relu", "class_name": "ReLU", "inbound_nodes": [[["conv1_bn", 0, 0, {}]]], "config": {"name": "conv1_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_dw_1", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv1_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "depth_multiplier": 1, "depthwise_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "name": "conv_dw_1", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "depthwise_regularizer": null}}, {"name": "conv_dw_1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_1", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_dw_1_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_dw_1_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_1_bn", 0, 0, {}]]], "config": {"name": "conv_dw_1_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_pw_1", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_1_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "filters": 64, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv_pw_1", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "conv_pw_1_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_1", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_pw_1_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_pw_1_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_1_bn", 0, 0, {}]]], "config": {"name": "conv_pw_1_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_pad_2", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_1_relu", 0, 0, {}]]], "config": {"name": "conv_pad_2", "trainable": true, "padding": [[0, 1], [0, 1]], "dtype": "float32", "data_format": "channels_last"}}, {"name": "conv_dw_2", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_2", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "depth_multiplier": 1, "depthwise_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "name": "conv_dw_2", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "valid", "depthwise_regularizer": null}}, {"name": "conv_dw_2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_2", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_dw_2_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_dw_2_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_2_bn", 0, 0, {}]]], "config": {"name": "conv_dw_2_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_pw_2", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_2_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "filters": 128, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv_pw_2", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "conv_pw_2_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_2", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_pw_2_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_pw_2_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_2_bn", 0, 0, {}]]], "config": {"name": "conv_pw_2_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_dw_3", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_2_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "depth_multiplier": 1, "depthwise_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "name": "conv_dw_3", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "depthwise_regularizer": null}}, {"name": "conv_dw_3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_3", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_dw_3_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_dw_3_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_3_bn", 0, 0, {}]]], "config": {"name": "conv_dw_3_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_pw_3", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_3_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "filters": 128, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv_pw_3", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "conv_pw_3_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_3", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_pw_3_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_pw_3_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_3_bn", 0, 0, {}]]], "config": {"name": "conv_pw_3_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_pad_4", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_3_relu", 0, 0, {}]]], "config": {"name": "conv_pad_4", "trainable": true, "padding": [[0, 1], [0, 1]], "dtype": "float32", "data_format": "channels_last"}}, {"name": "conv_dw_4", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_4", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "depth_multiplier": 1, "depthwise_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "name": "conv_dw_4", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "valid", "depthwise_regularizer": null}}, {"name": "conv_dw_4_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_4", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_dw_4_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_dw_4_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_4_bn", 0, 0, {}]]], "config": {"name": "conv_dw_4_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_pw_4", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_4_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "filters": 256, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv_pw_4", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "conv_pw_4_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_4", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_pw_4_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_pw_4_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_4_bn", 0, 0, {}]]], "config": {"name": "conv_pw_4_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_dw_5", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_4_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "depth_multiplier": 1, "depthwise_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "name": "conv_dw_5", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "depthwise_regularizer": null}}, {"name": "conv_dw_5_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_5", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_dw_5_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_dw_5_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_5_bn", 0, 0, {}]]], "config": {"name": "conv_dw_5_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_pw_5", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_5_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "filters": 256, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv_pw_5", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "conv_pw_5_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_5", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_pw_5_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_pw_5_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_5_bn", 0, 0, {}]]], "config": {"name": "conv_pw_5_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_pad_6", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_5_relu", 0, 0, {}]]], "config": {"name": "conv_pad_6", "trainable": true, "padding": [[0, 1], [0, 1]], "dtype": "float32", "data_format": "channels_last"}}, {"name": "conv_dw_6", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_6", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "depth_multiplier": 1, "depthwise_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "name": "conv_dw_6", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "valid", "depthwise_regularizer": null}}, {"name": "conv_dw_6_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_6", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_dw_6_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_dw_6_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_6_bn", 0, 0, {}]]], "config": {"name": "conv_dw_6_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_pw_6", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_6_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "filters": 512, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv_pw_6", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "conv_pw_6_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_6", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_pw_6_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_pw_6_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_6_bn", 0, 0, {}]]], "config": {"name": "conv_pw_6_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_dw_7", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_6_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "depth_multiplier": 1, "depthwise_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "name": "conv_dw_7", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "depthwise_regularizer": null}}, {"name": "conv_dw_7_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_7", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_dw_7_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_dw_7_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_7_bn", 0, 0, {}]]], "config": {"name": "conv_dw_7_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_pw_7", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_7_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "filters": 512, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv_pw_7", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "conv_pw_7_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_7", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_pw_7_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_pw_7_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_7_bn", 0, 0, {}]]], "config": {"name": "conv_pw_7_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_dw_8", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_7_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "depth_multiplier": 1, "depthwise_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "name": "conv_dw_8", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "depthwise_regularizer": null}}, {"name": "conv_dw_8_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_8", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_dw_8_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_dw_8_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_8_bn", 0, 0, {}]]], "config": {"name": "conv_dw_8_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_pw_8", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_8_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "filters": 512, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv_pw_8", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "conv_pw_8_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_8", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_pw_8_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_pw_8_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_8_bn", 0, 0, {}]]], "config": {"name": "conv_pw_8_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_dw_9", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_8_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "depth_multiplier": 1, "depthwise_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "name": "conv_dw_9", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "depthwise_regularizer": null}}, {"name": "conv_dw_9_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_9", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_dw_9_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_dw_9_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_9_bn", 0, 0, {}]]], "config": {"name": "conv_dw_9_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_pw_9", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_9_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "filters": 512, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv_pw_9", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "conv_pw_9_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_9", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_pw_9_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_pw_9_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_9_bn", 0, 0, {}]]], "config": {"name": "conv_pw_9_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_dw_10", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_9_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "depth_multiplier": 1, "depthwise_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "name": "conv_dw_10", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "depthwise_regularizer": null}}, {"name": "conv_dw_10_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_10", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_dw_10_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_dw_10_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_10_bn", 0, 0, {}]]], "config": {"name": "conv_dw_10_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_pw_10", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_10_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "filters": 512, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv_pw_10", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "conv_pw_10_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_10", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_pw_10_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_pw_10_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_10_bn", 0, 0, {}]]], "config": {"name": "conv_pw_10_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_dw_11", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_10_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "depth_multiplier": 1, "depthwise_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "name": "conv_dw_11", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "depthwise_regularizer": null}}, {"name": "conv_dw_11_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_11", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_dw_11_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_dw_11_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_11_bn", 0, 0, {}]]], "config": {"name": "conv_dw_11_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_pw_11", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_11_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "filters": 512, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv_pw_11", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "conv_pw_11_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_11", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_pw_11_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_pw_11_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_11_bn", 0, 0, {}]]], "config": {"name": "conv_pw_11_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_pad_12", "class_name": "ZeroPadding2D", "inbound_nodes": [[["conv_pw_11_relu", 0, 0, {}]]], "config": {"name": "conv_pad_12", "trainable": true, "padding": [[0, 1], [0, 1]], "dtype": "float32", "data_format": "channels_last"}}, {"name": "conv_dw_12", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pad_12", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "depth_multiplier": 1, "depthwise_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "name": "conv_dw_12", "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "valid", "depthwise_regularizer": null}}, {"name": "conv_dw_12_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_12", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_dw_12_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_dw_12_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_12_bn", 0, 0, {}]]], "config": {"name": "conv_dw_12_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_pw_12", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_12_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "filters": 1024, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv_pw_12", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "conv_pw_12_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_12", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_pw_12_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_pw_12_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_12_bn", 0, 0, {}]]], "config": {"name": "conv_pw_12_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_dw_13", "class_name": "DepthwiseConv2D", "inbound_nodes": [[["conv_pw_12_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "depth_multiplier": 1, "depthwise_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "activation": "linear", "name": "conv_dw_13", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "padding": "same", "depthwise_regularizer": null}}, {"name": "conv_dw_13_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_dw_13", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_dw_13_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_dw_13_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_dw_13_bn", 0, 0, {}]]], "config": {"name": "conv_dw_13_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "conv_pw_13", "class_name": "Conv2D", "inbound_nodes": [[["conv_dw_13_relu", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": false, "filters": 1024, "padding": "same", "dilation_rate": [1, 1], "kernel_size": [1, 1], "name": "conv_pw_13", "activity_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "conv_pw_13_bn", "class_name": "BatchNormalization", "inbound_nodes": [[["conv_pw_13", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "scale": true, "epsilon": 0.001, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "name": "conv_pw_13_bn", "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_regularizer": null}}, {"name": "conv_pw_13_relu", "class_name": "ReLU", "inbound_nodes": [[["conv_pw_13_bn", 0, 0, {}]]], "config": {"name": "conv_pw_13_relu", "trainable": true, "threshold": 0.0, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0}}, {"name": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["conv_pw_13_relu", 0, 0, {}]]], "config": {"name": "global_average_pooling2d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": true, "units": 1024, "name": "dense_1", "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": true, "units": 1024, "name": "dense_2", "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": true, "units": 512, "name": "dense_3", "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "dense_4", "class_name": "Dense", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": true, "units": 60, "name": "dense_4", "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}, {"name": "dense_5", "class_name": "Dense", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "use_bias": true, "units": 2, "name": "dense_5", "activity_regularizer": null, "activation": "softmax", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}}}]}}